#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.vpc: Reading...
data.aws_vpc.vpc: Read complete after 0s [id=vpc-009b0a699704bf9c5]
data.aws_subnets.subnets: Reading...
aws_security_group.db_sg: Refreshing state... [id=sg-0f36d3bb1d4054f99]
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-02a250369eb3c2fbf"]: Reading...
data.aws_subnet.subnet["subnet-01949927b7ff6ef5e"]: Reading...
data.aws_subnet.subnet["subnet-09e8c3a446ffff4a6"]: Reading...
data.aws_subnet.subnet["subnet-0d603d8a57ee8998e"]: Reading...
data.aws_subnet.subnet["subnet-08ebd9fd78c01f015"]: Reading...
data.aws_subnet.subnet["subnet-04620374fe59ef1ac"]: Reading...
data.aws_subnet.subnet["subnet-02a250369eb3c2fbf"]: Read complete after 0s [id=subnet-02a250369eb3c2fbf]
data.aws_subnet.subnet["subnet-04620374fe59ef1ac"]: Read complete after 0s [id=subnet-04620374fe59ef1ac]
data.aws_subnet.subnet["subnet-09e8c3a446ffff4a6"]: Read complete after 0s [id=subnet-09e8c3a446ffff4a6]
data.aws_subnet.subnet["subnet-01949927b7ff6ef5e"]: Read complete after 0s [id=subnet-01949927b7ff6ef5e]
data.aws_subnet.subnet["subnet-08ebd9fd78c01f015"]: Read complete after 0s [id=subnet-08ebd9fd78c01f015]
data.aws_subnet.subnet["subnet-0d603d8a57ee8998e"]: Read complete after 0s [id=subnet-0d603d8a57ee8998e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.postgres-instance will be created
  + resource "aws_db_instance" "postgres-instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 30
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "lanchoneteDatabase"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "14.9"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "lanchonete-database"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.medium"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "tue:00:00-tue:03:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres14"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Env"  = "Production"
          + "Name" = "PostgresDatabase"
        }
      + tags_all                              = {
          + "Env"  = "Production"
          + "Name" = "PostgresDatabase"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-0f36d3bb1d4054f99",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rds_endpoint          = (known after apply)
  + rds_port              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @anadezuo, Action: `pull_request`*